<template>
  <section class="term-of-use">
    <p-button class="control-button p-text-button" label="Вернуться" @click="goBack" icon="pi pi-arrow-left" />
    <h1>Пользовательское Соглашение</h1>
    <h2>Введение</h2>

    <p>
      Настоящее Пользовательское Соглашение (далее – «Соглашение») регулирует отношения между пользователем (далее –
      «Пользователь») и владельцем приложения (далее – «Приложение»), касающиеся использования данного Приложения для
      прохождения психологических тестов.
    </p>

    <div>
      <p>1. Регистрация и Авторизация</p>
      <p>1.1. Для использования Приложения Пользователь обязан пройти процедуру регистрации.</p>
      <p>1.2. При регистрации Пользователь предоставляет следующие данные:</p>
    </div>

    <div>
      <p>данные Google аккаунта;</p>
      <p>номер телефона;</p>
      <p>ФИО;</p>
      <p>специальность вуза;</p>
      <p>курс обучения.</p>
    </div>

    <div>
      <p>
        1.3. Пользователь соглашается с тем, что предоставленные данные будут использоваться в соответствии с настоящим
        Соглашением и Политикой конфиденциальности.
      </p>
    </div>

    <div>
      <p>2. Использование Приложения</p>
      <p>2.1. Приложение предназначено для прохождения психологических тестов в образовательных и личных целях.</p>
      <p>
        2.2. Пользователь обязуется использовать Приложение в соответствии с действующим законодательством и не нарушать
        права третьих лиц.
      </p>
      <p>
        2.3. Пользователь несет ответственность за достоверность и актуальность предоставленных данных при регистрации.
      </p>
    </div>

    <div>
      <p>3. Конфиденциальность и Защита Личных Данных</p>
      <p>
        3.1. Вся информация, предоставленная Пользователем при регистрации, хранится и обрабатывается в соответствии с
        Политикой конфиденциальности.
      </p>
      <p>
        3.2. Приложение обязуется не передавать личные данные Пользователя третьим лицам без его согласия, за
        исключением случаев, предусмотренных законодательством.
      </p>
      <p>3.3. Пользователь имеет право на доступ к своим данным, их изменение и удаление в любое время.</p>
    </div>

    <div>
      <p>4. Ответственность</p>
      <p>4.1. Приложение не несет ответственности за точность и достоверность результатов психологических тестов.</p>
      <p>
        4.2. Приложение не несет ответственности за любые убытки или ущерб, возникшие в результате использования
        Приложения.
      </p>
      <p>
        4.3. Пользователь несет полную ответственность за сохранность своих данных для входа в Приложение и обязуется не
        передавать их третьим лицам.
      </p>
      <p>4.4. Использование данных Пользователя третьими лицами не является ответственностью Приложения.</p>
      <p>
        4.5. Приложение оставляет за собой право заблокировать доступ Пользователя к Приложению в случае нарушения им
        условий настоящего Соглашения.
      </p>
    </div>

    <div>
      <p>5. Изменения в Соглашении</p>
      <p>5.1. Приложение оставляет за собой право вносить изменения в настоящее Соглашение.</p>
      <p>
        5.2. Изменения вступают в силу с момента их публикации в Приложении. Пользователь обязан самостоятельно следить
        за актуальной версией Соглашения.
      </p>
    </div>

    <div>
      <p>6. Прочие Условия</p>
      <p>6.1. Настоящее Соглашение регулируется законодательством страны, где зарегистрировано Приложение.</p>
      <p>
        6.2. В случае возникновения споров стороны будут стремиться к их разрешению путем переговоров. Если согласие не
        будет достигнуто, спор будет передан на рассмотрение в соответствующий суд по месту регистрации Приложения.
      </p>
      <p>
        Присоединяясь к настоящему Соглашению, Пользователь подтверждает, что ознакомлен с его условиями, понимает их и
        принимает в полном объеме.
      </p>
    </div>
  </section>
</template>

<script setup lang="ts">
import PButton from 'primevue/button'
import { useRedirect } from '@/composables/useRedirect'

const { goBack } = useRedirect()
</script>

<style scoped lang="scss">
.term-of-use {
  display: flex;
  flex-direction: column;
  align-items: center;
  justify-content: center;
  height: 100%;
  min-height: 86vh;
  background-color: #f5f5f5;
  color: black;
  width: 100vw;
  padding: 2rem;

  h1 {
    font-size: 1.5rem;
    text-align: center;
  }

  h2 {
    font-size: 1.2rem;
  }

  p {
    font-size: 1rem;
  }

  div {
    display: flex;
    flex-direction: column;
    align-items: flex-start;
  }
}
</style>
